# Terraform Plan


## repo-setup

|  Step      |   Outcome                        |
|------------|----------------------------------|
| `init`     | :white_check_mark:     |
| `fmt`      | :white_check_mark:      |
| `validate` | :white_check_mark: |
| `plan`     | :white_check_mark:     |


<details><summary>Show Plan</summary>

```terraform
data.aws_iam_policy_document.repo_role: Reading...
data.aws_iam_policy_document.repo_role: Read complete after 0s [id=3547487238]
module.basic_repo_role.data.aws_iam_policy.tf_state_dependency_interaction: Reading...
module.basic_repo_role.module.github_oidc_role.data.aws_iam_policy_document.github: Reading...
module.basic_repo_role.module.github_oidc_role.data.aws_iam_policy_document.github: Read complete after 0s [id=428434398]
module.basic_repo_role.data.aws_iam_policy.tf_state_dependency_interaction: Read complete after 1s [id=arn:aws:iam::XXXXX:policy/tf-state-dependency-interaction]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.repo_role will be created
  + resource "aws_iam_policy" "repo_role" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "This policy assigns permissions to create an s3 bucket and DynamoDB table"
      + id               = (known after apply)
      + name             = "S3AndBucketCreation"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObjectAcl",
                          + "s3:PutBucketVersioning",
                          + "s3:PutBucketTagging",
                          + "s3:PutBucketOwnershipControls",
                          + "s3:PutBucketAcl",
                          + "s3:ListBucket",
                          + "s3:GetReplicationConfiguration",
                          + "s3:GetLifecycleConfiguration",
                          + "s3:GetEncryptionConfiguration",
                          + "s3:GetBucketWebsite",
                          + "s3:GetBucketVersioning",
                          + "s3:GetBucketTagging",
                          + "s3:GetBucketRequestPayment",
                          + "s3:GetBucketPolicy",
                          + "s3:GetBucketOwnershipControls",
                          + "s3:GetBucketObjectLockConfiguration",
                          + "s3:GetBucketLogging",
                          + "s3:GetBucketCors",
                          + "s3:GetBucketAcl",
                          + "s3:GetAccelerateConfiguration",
                          + "s3:DeleteBucket",
                          + "s3:CreateBucket",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::tf-state*"
                      + Sid      = "S3"
                    },
                  + {
                      + Action   = [
                          + "dynamodb:TagResource",
                          + "dynamodb:ListTagsOfResource",
                          + "dynamodb:DescribeTimeToLive",
                          + "dynamodb:DescribeTable",
                          + "dynamodb:DescribeContinuousBackups",
                          + "dynamodb:CreateTable",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:*:*:table/tf-state-lock"
                      + Sid      = "DynamoDB"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_role_policy_attachment.repo_role will be created
  + resource "aws_iam_role_policy_attachment" "repo_role" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "github_infra_tf-state-remote-backend"
    }

  # module.basic_repo_role.aws_iam_role_policy_attachment.tf_state_dependency_interaction will be created
  + resource "aws_iam_role_policy_attachment" "tf_state_dependency_interaction" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::266670751028:policy/tf-state-dependency-interaction"
      + role       = "github_infra_tf-state-remote-backend"
    }

  # module.basic_repo_role.module.github_oidc_role.aws_iam_role.github will be created
  + resource "aws_iam_role" "github" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:mechwire/tf-state-remote-backend:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::266670751028:oidc-provider/token.actions.githubusercontent.com"
                        }
                      + Sid       = "GitHubActionsOIDCAuth"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "github_infra_tf-state-remote-backend"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "github"     = "true"
          + "repository" = "tf-state-remote-backend"
        }
      + tags_all              = {
          + "github"     = "true"
          + "repository" = "tf-state-remote-backend"
        }
      + unique_id             = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Warnings:

- Value for undeclared variable
- Value for undeclared variable
- Values for undeclared variables
- Backend configuration ignored
  on ../repo_role/main.tf line 2
- Redundant empty provider block
  on ../repo_role/main.tf line 11

To see the full warning notes, run Terraform without -compact-warnings.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>


## general

|  Step      |   Outcome                        |
|------------|----------------------------------|
| `init`     | :white_check_mark:     |
| `fmt`      | :white_check_mark:      |
| `validate` | :white_check_mark: |
| `plan`     | :white_check_mark:     |


<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.tf_state_dependency will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "tf_state_dependency" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "TFStateS3Dependency"
        }
      + statement {
          + actions   = [
              + "dynamodb:DeleteItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "TFStateDynamoDBDependency"
        }
    }

  # aws_dynamodb_table.tf_state will be created
  + resource "aws_dynamodb_table" "tf_state" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = "tf-state-lock"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "github"     = "true"
          + "repository" = "tf-state-remote-backend"
        }
      + tags_all         = {
          + "github"     = "true"
          + "repository" = "tf-state-remote-backend"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }
    }

  # aws_iam_policy.tf_state_dependency will be created
  + resource "aws_iam_policy" "tf_state_dependency" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "This policy assigns permissions to interact with a tfstate stored in s3 and locks in DynamoDB."
      + id               = (known after apply)
      + name             = "tf-state-dependency-interaction"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_s3_bucket.tf_state will be created
  + resource "aws_s3_bucket" "tf_state" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "tf-state"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "github"     = "true"
          + "repository" = "tf-state-remote-backend"
        }
      + tags_all                    = {
          + "github"     = "true"
          + "repository" = "tf-state-remote-backend"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_acl.tf_state will be created
  + resource "aws_s3_bucket_acl" "tf_state" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # aws_s3_bucket_ownership_controls.tf_state will be created
  + resource "aws_s3_bucket_ownership_controls" "tf_state" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # aws_s3_bucket_versioning.tf_state will be created
  + resource "aws_s3_bucket_versioning" "tf_state" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Warnings:

- Value for undeclared variable
- Value for undeclared variable
- Values for undeclared variables

To see the full warning notes, run Terraform without -compact-warnings.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
